#include <stdio.h>

void main()
{
	int *arr, a[10], *b, c[3][5], *d[10], e, *q, i;
	arr = &i;
	arr = a;
	a = arr;            // לא תעבור קומפילציה כי אי אפשר להכניס כתובת של מצביע לכתובת של מערך
	q = arr = d[0];
	arr = c[2];
	b = c;           // לא תעבור קומפילציה כי אי אפשר להכניס כתובת של מערך דו ממדי למצביע
	a[7] = *(*(c + 2) + 3);
	*a = 2 + &b;		    // לא תעבור קומפילציה כי אי אפשר להכניס כתובת של מצביע לתוכן מצביע המערך
	a[5] = q[0];
	*q = *a;
	q = a++;			 // לא תעבור קומפילציה כי אי אפשר לקדם שם של מערך ללא זקיף
	a = b;			    // לא תעבור קומפילציה כי אי אפשר להכניס לכתובת המערך כתובת של מצביע
	b = a + 3;
	a = *b;           // לא תעבור קומפילציה כי אי אפשר להכניס ערך של מצביע לתוך כתובת של מערך
	b = &e;
	*b = *a;
	b = c[3];
	b = &a;       // לא תעבור קומפילציה כי אי אפשר להכניס את כתובת המצביע של המערך לתוך מצביע רגיל 
	*a = *b;
}

void main()
{
	int a, *b, c[4];
	*(c + 3) = 8;
	a = *(c + *b);
	*(c++) = 12;  // לא תעבור קומפילציה
	c = b;       // לא תעבור קומפילציה
	b = c;
	a = (*c)++;
	*(b + 1) = (*c)++;
	a = *b - *c;
	*c = *(b++);
	*(b++) = *(&a);
	*b == 2 = a;    // לא תעבור קומפילציה
	c[3] = *b == 2;
}

// Atalo Abeje